/**
 * *****************************************************************************
 * @file        co2.h
 * @brief       
 * @author      wenbo.zhang (1992552138@qq.com)
 * @date        2024-09-17
 * @copyright   xxxx技有限公司
 * *****************************************************************************
 */
#include "sensor_common.h"

#ifndef CO2_H 
#define CO2_H 

#define CO2_EXCELLENT (100U)
#define CO2_GOOD (200U)
#define CO2_AVERAGE (300U)

QualityLevel GetCo2Level1(void);
void DisplayCo2Level(QualityLevel lv);
static UInt16 GetRawDataCo2(void);
QualityLevel GetCo2Level(void);

#ifdef __cplusplus
extern "C"{
#endif

/*----------------------------------include-----------------------------------*/

/*-----------------------------------macro------------------------------------*/

/*----------------------------------typedef-----------------------------------*/

/*----------------------------------variable----------------------------------*/

/*-------------------------------------os-------------------------------------*/

/*----------------------------------function----------------------------------*/

/*------------------------------------test------------------------------------*/

#ifdef __cplusplus
}
#endif

#endif	/* CO2_H */
