/**
 * *****************************************************************************
 * @file        pm2.5.h
 * @brief       
 * @author      wenbo.zhang (1992552138@qq.com)
 * @date        2024-09-17
 * @copyright   xxxx技有限公司
 * *****************************************************************************
 */

#ifndef PM25_H 
#define PM25_H 

#include "sensor_common.h"

#define PM25_EXCELLENT (10U)
#define PM25_GOOD (35U)
#define PM25_AVERAGE (75U)

static UInt16 GetRawDataPm25(void);
QualityLevel GetPm25Class(void);
QualityLevel GetPm25Level(void);
void DisplayPm25Level(QualityLevel lv);

#ifdef __cplusplus
extern "C"{
#endif

/*----------------------------------include-----------------------------------*/

/*-----------------------------------macro------------------------------------*/

/*----------------------------------typedef-----------------------------------*/

/*----------------------------------variable----------------------------------*/

/*-------------------------------------os-------------------------------------*/

/*----------------------------------function----------------------------------*/

/*------------------------------------test------------------------------------*/

#ifdef __cplusplus
}
#endif

#endif	/* PM25_H */

